# IMPORT
from reportlab.pdfbase import pdfmetrics
from reportlab.pdfbase.ttfonts import TTFont
from reportlab.platypus import SimpleDocTemplate, Table, TableStyle
from reportlab.lib.pagesizes import A4
from reportlab.lib import colors

# Data from LW1 and LW2
internet = 20737.95
phone    = 370.12
sms      = 52.0

# Data for tables
pdf_file = 'Service_invoice.pdf'
data_001 = [
    ['ПАО Сбербанк\n\n\nБанк получателя'            , ''          , '', '', ''             , ''         , '', '', 'БИК'  , '044525225'                     , '', '', ''],
    [''                                             , ''          , '', '', ''             , ''         , '', '', 'Сч. №', '30101810400000000225\n\n'      , '', '', ''],
    [''                                             , ''          , '', '', ''             , ''         , '', '', ''     , ''                              , '', '', ''],
    ['ИНН 7707083893'                               , ''          , '', '', 'КПП 773601001', ''         , '', '', 'Сч. №', '40702810900000002453\n\n\n\n\n', '', '', ''],
    ['ООО "Услуга"\n\n\nПолучатель'                 , ''          , '', '', ''             , ''         , '', '', ''     , ''                              , '', '', ''],
    [''                                             , ''          , '', '', ''             , ''         , '', '', ''     , ''                              , '', '', ''],
    [''                                             , ''          , '', '', ''             , ''         , '', '', ''     , ''                              , '', '', '']
]
text1 = 'ООО "Услуга", ИНН 7722737753, КПП 773301001, 109052, г. Москва,'
text2 = 'ул. ДОБРЫНИНСКАЯ, дом №70, корпус 2'
data_002 = [
    ['Счет на оплату № 1 от 01 мая 2020 г.', '', ''                                                           , '', '', '', '', '', '', '', '', '', ''],
    [''                                    , '', ''                                                           , '', '', '', '', '', '', '', '', '', ''],
    ['Поставщик'                           , '', text1                                                        , '', '', '', '', '', '', '', '', '', ''],
    ['(Исполнитель):'                      , '', text2                                                        , '', '', '', '', '', '', '', '', '', ''],
    [''                                    , '', ''                                                           , '', '', '', '', '', '', '', '', '', ''],
    ['Покупатель'                          , '', 'Греф Давид Голиафович, ИНН 387347777003, г. Санкт-Петербург', '', '', '', '', '', '', '', '', '', ''],
    ['(Заказчик):'                         , '', ''                                                           , '', '', '', '', '', '', '', '', '', ''],
    [''                                    , '', ''                                                           , '', '', '', '', '', '', '', '', '', ''],
    ['Основание:'                          , '', 'Договор № 01012020 от 01.01.2020'                           , '', '', '', '', '', '', '', '', '', '']
]
data_003 = [
    ['№', 'Товары (работы, услуги)'  , '', '', '', '', 'Кол-во', 'Ед.', 'Цена'    , '', 'Сумма'   , '', ''],
    ['1', 'Плата за услуги Интернет' , '', '', '', '', '1'     , 'шт' , '20737.95', '', '20737.95', '', ''],
    ['2', 'Плата за услуги Телефония', '', '', '', '', '1'     , 'шт' , '370.12'  , '', '370.12'  , '', ''],
    ['3', 'Плата за услуги SMS'      , '', '', '', '', '1'     , 'шт' , '52.00'   , '', '52.00'   , '', '']
]
data_004 = [
    [''                                                                          , '', '', '', '', '', '', '', 'Итого:'          , '', '', str(internet + phone + sms)        , ''],
    [''                                                                          , '', '', '', '', '', '', '', 'В том числе НДС:', '', '', str((internet + phone + sms) * 0.2), ''],
    [''                                                                          , '', '', '', '', '', '', '', 'Всего к оплате:' , '', '', str(internet + phone + sms)        , ''],
    ['Всего наименований 3, на сумму {} руб.'.format(str(internet + phone + sms)), '', '', '', '', '', '', '', ''                , '', '', ''                                 , ''],
    ['Двадцать одна тысяча сто шестьдесят рублей 07 копеек'                      , '', '', '', '', '', '', '', ''                , '', '', ''                                 , '']
]
data_005 = [
    ['Внимание!'                                                                                          , '', ''                , '', '', '', ''         , '', ''                , '', '', '', ''],
    ['Оплата данного счета означает согласие с условиями поставки товара.'                                , '', ''                , '', '', '', ''         , '', ''                , '', '', '', ''],
    ['Уведомление об оплате обязательно, в противном случае не гарантируется наличие товара на складе.'   , '', ''                , '', '', '', ''         , '', ''                , '', '', '', ''],
    ['Товар отпускается по факту прихода денег на р/с Поставщика, самовывозом, при наличии доверенности и', '', ''                , '', '', '', ''         , '', ''                , '', '', '', ''],
    ['паспорта.'                                                                                          , '', ''                , '', '', '', ''         , '', ''                , '', '', '', ''],
    [''                                                                                                   , '', ''                , '', '', '', ''         , '', ''                , '', '', '', ''],
    [''                                                                                                   , '', ''                , '', '', '', ''         , '', ''                , '', '', '', ''],
    ['Руководитель'                                                                                       , '', 'Колесников Н. Д.', '', '', '', 'Бухгалтер', '', 'Колесников Н. Д.', '', '', '', '']
]

# Create pdf file for data above
def create_pdf():
    # FONT
    pdfmetrics.registerFont(TTFont('Times', 'Times New Roman.ttf'))
    pdfmetrics.registerFont(TTFont('Times-Bold', 'Times New Roman (Bold).ttf'))
    
    # FILE
    pdf = SimpleDocTemplate(
        filename= pdf_file,
        pagesize=A4
    )
    
    # TABLE 001
    table_001 = Table(data_001, colWidths=[40 for i in range(13)])
    
    style_001 = TableStyle([
        # SPAN part
        ('SPAN', (0, 0), (7, 2)),
        ('SPAN', (0, 3), (3, 3)), ('SPAN', (4, 3), (7, 3)),
        ('SPAN', (0, 4), (7, 6)),
        ('SPAN', (8, 1), (8, 2)),
        ('SPAN', (8, 3), (8, 6)),
        ('SPAN', (9, 0), (11, 0)),
        ('SPAN', (9, 1), (11, 2)),
        ('SPAN', (9, 3), (11, 6)),
        # STYLE part
        ('FONTNAME', (0, 0), (-2, -1), 'Times'),
        ('BOX',  (0, 0), (-2, -1), 0.5, colors.black),
        ('GRID', (0, 0), (-2, -1), 0.5, colors.black),
        ('VALIGN', (8, 0), (8, 6), 'TOP')
    ])
    table_001.setStyle(style_001)
    
    # TABLE 002
    table_002 = Table(data_002, colWidths=[40 for i in range(13)])
    
    style_002 = TableStyle([
        # SPAN part
        ('SPAN', (0, 0), (11, 1)),
        # STYLE part
        ('FONTNAME', (0, 0), (-2, 1), 'Times-Bold'),
        ('FONTSIZE', (0, 0), (-2, 1), 18),
        ('VALIGN',   (0, 0), (-2, 1), 'TOP'),
        ('LINEABOVE', (0, 2), (-2, 2), 2, colors.black),
        ('TOPPADDING', (0, 2), (-2, 2), 10),
        ('FONTNAME', (0, 2), (0, -1), 'Times'),
        ('FONTNAME', (2, 2), (-2, -1), 'Times-Bold'),
        ('BOTTOMPADDING', (0, -1), (-2, -1), 20)
    ])
    table_002.setStyle(style_002)
    
    # TABLE 003
    table_003 = Table(data_003, colWidths=[40 for i in range(13)])
    
    style_003 = TableStyle([
        # SPAN part
        ('SPAN', (0, 0), (0, 0)), ('SPAN', (1, 0), (5, 0)), ('SPAN', (6, 0), (6, 0)), ('SPAN', (7, 0), (7, 0)), ('SPAN', (8, 0), (9, 0)), ('SPAN', (10, 0), (11, 0)),
        ('SPAN', (0, 1), (0, 1)), ('SPAN', (1, 1), (5, 1)), ('SPAN', (6, 1), (6, 1)), ('SPAN', (7, 1), (7, 1)), ('SPAN', (8, 1), (9, 1)), ('SPAN', (10, 1), (11, 1)),
        ('SPAN', (0, 2), (0, 2)), ('SPAN', (1, 2), (5, 2)), ('SPAN', (6, 2), (6, 2)), ('SPAN', (7, 2), (7, 2)), ('SPAN', (8, 2), (9, 2)), ('SPAN', (10, 2), (11, 2)),
        ('SPAN', (0, 3), (0, 3)), ('SPAN', (1, 3), (5, 3)), ('SPAN', (6, 3), (6, 3)), ('SPAN', (7, 3), (7, 3)), ('SPAN', (8, 3), (9, 3)), ('SPAN', (10, 3), (11, 3)),
        # STYLE part
        ('FONTNAME', (0, 0), (-2, 0), 'Times-Bold'),
        ('ALIGN', (0, 0), (-2, 0), 'CENTER'),
        ('FONTNAME', (0, 1), (-2, -1), 'Times'),
        ('BOX',  (0, 0), (-2, -1), 1, colors.black),
        ('GRID', (0, 0), (-2, -1), 0.5, colors.black),
        ('ALIGN', (0, 1), (0, -1), 'CENTER')
    ])
    table_003.setStyle(style_003)
    
    # TABLE 004
    table_004 = Table(data_004, colWidths=[40 for i in range(13)])
    
    style_004 = TableStyle([
        # SPAN part
        ('SPAN', (0, 0), (0, 0)),
        # STYLE part
        ('TOPPADDING', (0, 0), (-2, 0), 10),
        ('FONTNAME', (0, 0), (-2, 2), 'Times-Bold'),
        ('FONTNAME', (0, 3), (-2, 3), 'Times'),
        ('FONTNAME', (0, 4), (-2, 4), 'Times-Bold')
    ])
    table_004.setStyle(style_004)
    
    # TABLE 005
    table_005 = Table(data_005, colWidths=[40 for i in range(13)])
    
    style_005 = TableStyle([
        # SPAN part
        ('SPAN', (0, -1), (1, -1)), ('SPAN', (6, -1), (7, -1)),
        # STYLE part
        ('TOPPADDING', (0, 0), (-2, 0), 20),
        ('FONTNAME', (0, 0), (-2, -1), 'Times'),
        ('LINEABOVE', (0, -2), (-2, -2), 2, colors.black),
        ('LINEBELOW', (2, -1), (5, -1), 0.5, colors.black),
        ('LINEBELOW', (8, -1), (11, -1), 0.5, colors.black),
        ('ALIGN', (0, -1), (1, -1), 'RIGHT'),
        ('ALIGN', (6, -1), (7, -1), 'RIGHT')
    ])
    table_005.setStyle(style_005)
    
    
    elems = []
    elems.append(table_001)
    elems.append(table_002)
    elems.append(table_003)
    elems.append(table_004)
    elems.append(table_005)
    
    pdf.build(elems)

create_pdf()